Firma/nalog_encrypted_and_signed.xml

<?xml version="1.0" encoding="UTF-8"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns2:getNalogZaPlacanjeRequest xmlns:ns2="http://nalogZaPlacanje.xml.com" xmlns:ns3="http://zahtevzadobijanjeizvoda.xml.com"><xenc:EncryptedData xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Type="http://www.w3.org/2001/04/xmlenc#Content"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#tripledes-cbc"/><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:KeyName>Sifrovan tajni kljuc</ds:KeyName>
<xenc:EncryptedKey xmlns:xenc="http://www.w3.org/2001/04/xmlenc#"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5"/><xenc:CipherData><xenc:CipherValue>KevZndnPw0ilMh8eKZVgZBbahjclxqE0xQv3gdL5u7z0fkBHGWMDLsOIw7Be/LSdAsl3MUeh+Krb&#13;
UXjUhZrk0GgvEVqj0OaXe1GzeweCf0DLjxn2UpIdiVo1tgNpFYhFuL0Njl8ArY+LDMS2PXccpZ5g&#13;
q8R3kgV9Sr44d/chV7uHDxXJ1Fvi7kzMBZMhwF/Je/jorx5rq6ErxZP2HJC0kMrb0N0RXnRHNW5P&#13;
5KSruUzx1BaVpLp9aCmVQfxXpODXQm8/PvdY5RW+rHnBbSYBaaZVCWdCsdk3Fyhd4Ed85iAka1yh&#13;
H1K3aVQNoYrKKyOwFcEMOZyNuh/kpgguGwMD8g==</xenc:CipherValue></xenc:CipherData></xenc:EncryptedKey></ds:KeyInfo><xenc:CipherData><xenc:CipherValue>VR6jOQshHLxdTt0GKot+do39N/+vqxQ+wHS8XI8CHiGAh5+znMYhNdowBCA/t3BydjI9ytxvtTia&#13;
Xb+ZXXPCaCdNkMkoMdgz2R9JNvNxJrKfuDv4DufKeEF9+lJLSjovKH4oabxhU7QvAWF5psNJXBsb&#13;
cGaDYIdCRb+2GN1Mpq78GxbUilebokLwEXO5dtTBLMMPaydTqY3FpSrgaz1Opa/Xx3MtLYUBNagm&#13;
2ChlWbxkrZCIFSknJA3zMrsSD9gyIbwnDG0DppgNN27EaS2fkc/DwVVjwXF2DIxuUd3xfBaDyraZ&#13;
RY0vO0SnhKVbciXwRkOrTq1rJBs3CHjQq6AVeu28fn8rKB1ZK+Ix7u/LAvx1kQ9vJYqzSuT2YTLt&#13;
u9rrWtPjILz5JJB5ORnLCjOu0/BCvN7rJm7nseb+7ZfG/251SPSe0paaxc8EOM10r9fT+oGJ4BcO&#13;
4GKxxWWNysF44Oyp6V8oaI/vxSPl3ia3fz28NJK7aLsDIjyfAByGTdwBCbymkOwlCuRsZAC+V6fg&#13;
bMUCtZl29sPQ1uH2QAXsc7Rrohjdz5539v/gWGpoUuY8CMB9TgYtyEjJ5aG0bHAwGLrIsesJ2r3m&#13;
JwschrTJcPa9N4rRL9W/y/9wjVn8Uvcd1LnqKEZKDYISC9r7mhOksfwScpa8BFlho8MPA3bCsJRc&#13;
r5/h5pdbwoLkeMaiJOSCq6JvfNviP9dbKS7KvRbt8zxSar6L52RcZXm82uW45S6Kb3LcaznOE5gW&#13;
Kxgr7/5qxipJXlGg5298nwkqdpJT6OHeArF9Er+M9z6J+DT7L+4+J7pOLmcKQBXhqyJwf4MKa9lE&#13;
MbFWzhko/goO4KnG7YII9CH+U9eF5QdecTOq9Syd1g1at3BK5+6PQjsPYo7AGJJHlzfZElxYN0mK&#13;
BiVwG+eW2l9MvdUU7fu4eNqZYeheeCJM4sWdPSC9x3h4zllxHv6ZyVrJVgsuT0gw09oGEi3IS76A&#13;
NKos</xenc:CipherValue></xenc:CipherData></xenc:EncryptedData></ns2:getNalogZaPlacanjeRequest></SOAP-ENV:Body><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:SignedInfo>
<ds:CanonicalizationMethod Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/>
<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
<ds:Reference URI="">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
<ds:Transform Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315#WithComments"/>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
<ds:DigestValue>W7DiFc3ftRv2ALfoo794tqo4L64=</ds:DigestValue>
</ds:Reference>
</ds:SignedInfo>
<ds:SignatureValue>
mGBVlMeGPJQDBnHi28MKPh27XEwWv/7OX9z7Gd1xIx/Rlof3N5/hxjZRYdGbTHDPowpUHLeWDUQy&#13;
EnouJRonvvyGPx/LZ1+eLPIk+AunF7QTjlKr/z/TrApWEZXf+JarN9slK9BIv6SW1dddTkiPzBEl&#13;
Tg1VEK5ODrzfcpIhtd9dAABaX1vv7se1c/Acw5DZBKoOcwPsgHm7vtYBHVHIIpd00n48ybYB5mNg&#13;
XokkP90Of7+/6iaUpkW6Lme6PCPGIlohqEFp61DWabZUEws9Fl24XGF89KVmM5Txbh0E/3oK/ORq&#13;
dOjLX70Wbwl2657kLf1f15aD6qf7RqLEgaIIzQ==
</ds:SignatureValue>
<ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:KeyValue>
<ds:RSAKeyValue>
<ds:Modulus>
qvq9L4TdlpRND/aAnYa969IckeVyjGtDV1DHs/GvtFYRHuW6giXxjm3SUtVtTQoRTIoqBSLfpMBe&#13;
JODaAh6rACQpAgWymU4pbRXz7UIPhhpkyNeEXwtl63ILNOtIj6bMGtKnj6cmMYzNvUoQBixbFTSg&#13;
ixi3O996Z/YvRQLgW1obxiooCBoZuFEnFlfcUzCtHE5XmvZUWs4EjNA/oj9H2rJ34SMBz89XNyTl&#13;
0TBQh4ZPYw0WxzDJAyrtAGLWaPq1vOyA8PnXX33kQHGB7ZJVTVDlsFoD3ftWYQ63/LPshqM3P8BE&#13;
/uav8luUhVcVRDCDfvvpvmmJSVi7fK0zY4QQ7Q==
</ds:Modulus>
<ds:Exponent>AQAB</ds:Exponent>
</ds:RSAKeyValue>
</ds:KeyValue>
<ds:X509Data>
<ds:X509Certificate>
MIIDgjCCAmqgAwIBAgIEWUhRPjANBgkqhkiG9w0BAQsFADB6MRAwDgYDVQQDDAdCYW5rYSBBMRAw&#13;
DgYDVQQKDAdCYW5rYSBBMQ4wDAYDVQQLDAVCYW5rYTEMMAoGA1UEBhMDc3JiMRowGAYJKoZIhvcN&#13;
AQkBFgtiYW5rYUBhLmNvbTEaMBgGCgmSJomT8ixkAQEMCjE0OTc5MTE0OTIwHhcNMTcwNjE5MDAw&#13;
MDAwWhcNMTgwNjE5MDAwMDAwWjB6MRAwDgYDVQQDDAdGaXJtYSBBMRAwDgYDVQQKDAdGaXJtYSBB&#13;
MQ4wDAYDVQQLDAVGaXJtYTEMMAoGA1UEBhMDc3JiMRowGAYJKoZIhvcNAQkBFgtmaXJtYUBhLmNv&#13;
bTEaMBgGCgmSJomT8ixkAQEMCjE0OTc5MTE2MTQwggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEK&#13;
AoIBAQCq+r0vhN2WlE0P9oCdhr3r0hyR5XKMa0NXUMez8a+0VhEe5bqCJfGObdJS1W1NChFMiioF&#13;
It+kwF4k4NoCHqsAJCkCBbKZTiltFfPtQg+GGmTI14RfC2Xrcgs060iPpswa0qePpyYxjM29ShAG&#13;
LFsVNKCLGLc733pn9i9FAuBbWhvGKigIGhm4UScWV9xTMK0cTlea9lRazgSM0D+iP0fasnfhIwHP&#13;
z1c3JOXRMFCHhk9jDRbHMMkDKu0AYtZo+rW87IDw+ddffeRAcYHtklVNUOWwWgPd+1ZhDrf8s+yG&#13;
ozc/wET+5q/yW5SFVxVEMIN+++m+aYlJWLt8rTNjhBDtAgMBAAGjEDAOMAwGA1UdEwEB/wQCMAAw&#13;
DQYJKoZIhvcNAQELBQADggEBABPql7l2SOkUU7ON9SEqNswIVn+RyAL+Y/9OBJ+0aU0lcvpgbFNZ&#13;
5GsCMufSLRK0z1HU2rKW969FAnxAbfvMAvTh8a1VKuSF1P259bjFSoCekPfDW8irKtdBwlXUQtfn&#13;
Av2mVWLhk9XhBQtN78BktFLuXG7aRfbgb6L/e9M6Z1XFM8QK5WzBo1Y/7C7js7R0thIX9OsBs0gD&#13;
yoK644NxtAH2JljgqREpcjKZwNhfXZ++SIK8O5zUM7hlo1C7N1XqkURhc7J5ADRIHf5cOJCqiE6d&#13;
Q2WnEbguq2W6D5tTN/qjfkOtu1AWa29vz3O2piue9WkfIqxC84/llz20jrIWfow=
</ds:X509Certificate>
</ds:X509Data>
</ds:KeyInfo>
</ds:Signature></SOAP-ENV:Envelope>